//
//  serviceProtocolViewController.m
//  imdSearch
//
//  Created by ding zhihong on 12-3-31.
//  Copyright (c) 2012年 i-md.com. All rights reserved.
//

#import "serviceProtocolViewController.h"
#import "registerViewController.h"
#import "NMCustomLabel.h"
#import "ImdAppBehavior.h"
#import "Util.h"

#define TXT_SERVICE_PROTOCOL @"<b>1.  您与睿医的关系</b>\n        1.1  您对睿医产品、软件、服务及网站（本文件中合称\"服务\"，不包括在单独的书面协议项下睿医向您提供的任何服务）的使用适用您和睿医之间法律协议的条款。 \"睿医\"指上海睿医信息科技有限公司，主营业地位于上海市江宁路212号凯迪克大厦10楼A座。本文件解释了协议如何制定，并陈述了协议中的若干条款。\n        1.2  除非与睿医另有书面协议，否则您与睿医的协议将始终至少包括本文件中陈述的条款和条件。这些条款和条件下称\"通用条款\"。\n        1.3  除通用条款外，您与睿医的协议亦将包括适用于服务的任何法律声明中的条款。所有这些法律声明中的条款下称\"额外条款\"。额外条款适用于服务时，您可在该服务范围内或使用该服务过程中读到该等条款。\n        1.4  通用条款，连同额外条款，构成您和睿医之间关于您使用服务的具有法律约束力的协议。您花时间仔细加以阅读是重要的。该法律协议以下合称\"本条款\"。\n        1.5  如果额外条款的内容和通用条款的内容发生任何冲突，则就该服务内容，应以额外条款为准。\n<b>2.  接受本条款</b>\n        2.1  使用服务必须首先同意本条款。如果您不接受本条款则不可使用服务。\n        2.2  您可通过下列方式接受本条款：\n                (A)  在有关任何服务的用户界面上睿医向您提供的选择处点击以接受或同意本条款；或\n                (B)  实际使用服务。在此情况下，您理解并同意睿医视您自使用服务时起接受本条款。\n        2.3  在下列情况下您不可使用服务且不能接受本条款：(a)您未达到与睿医订立有约束力的合同的法定年龄，或(b)根据中国或其他国家（包括您居住的或您从那里使用服务的国家）的法律，您是被禁止接受服务的人。\n<b>3.本条款语言</b>\n        3.1  睿医向您提供本条款中文文本的翻译件时，您同意翻译件仅供您方便之用，本条款的中文文本适用于您和睿医之间的关系。\n        3.2  如果本条款中文文本和翻译文本存在任何冲突，则以中文文本为准。\n<b>4.  睿医提供服务</b>\n        4.1  睿医在世界范围内拥有子公司和关联法律实体（\"子公司和关联公司\"）。在某些时候，这些公司将代表睿医向您提供服务。您认知并同意子公司和关联公司有权向您提供服务。\n        4.2  睿医不断创新以向其用户提供最优体验。您认知并同意睿医提供的服务的形式和本质可不经事先通知您而不时变换。\n        4.3  作为这种持续创新的一部分，您认知并同意睿医可自行决定，无须事先通知您，即停止（永久或暂时）向您或全体用户提供服务。您可在任何时候停止使用服务。您停止使用服务时无需特别通知睿医。\n        4.4  您认知并同意，如果睿医禁用对您的帐户的访问权，则您可能被阻止获得服务、您的帐户资料或包含在您帐户中的任何文件或其他内容。\n        4.5  您认知并同意，尽管睿医可能目前没有设置您可通过服务发送或接收的传输数量或用于提供任何服务的存储空间的上限，但睿医可自行决定在任何时候设置上限。\n<b>5.  您对服务的使用</b>\n        5.1  为获得某些服务，您可能会被要求提供自身信息（如身份、执业证号或联系资料）作为服务的登记程序的一部分，或作为您持续使用服务的一部分。您同意您给予睿医的任何登记信息均是准确、正确和最新的。\n        5.2  您同意仅为(a)本条款及(b)任何适用法律、法规或有关辖区内公认的惯例或准则（包括关于数据或软件向或从美国或其他相关国家出口的任何法律）所允许的目的使用服务。\n        5.3  您同意不以通过睿医提供的界面以外的任何方式获得（或试图获得）任何服务，除非您根据与睿医的单独协议获得特别允许。\n        5.4  您同意您不从事妨碍或者破坏服务（或与服务连接的服务器及网络）的任何活动。\n        5.5  除非您在与睿医的单独协议中获得特别允许，否则您同意您不为任何目的再制作、复制、拷贝、出售、交易或转售服务。\n        5.6  您同意独自就您违反您在本条款项下的义务以及任何该等违反的后果（包括睿医遭受的任何损失或损害）承担责任（睿医不对您或任何第三方承担责任）。\n<b>6.  您的密码和帐户安全</b>\n        6.1  您同意并理解您有责任将您与用于获得服务的任何帐户相关的密码保密。\n        6.2  据此，您同意将独自就在您帐户下的所有活动对睿医负责。\n        6.3  如果您得知任何对您的密码或您的帐户的任何未经授权的使用，您同意立即通知睿医。\n<b>7.  隐私与您的个人信息</b>\n        7.1  关于睿医的数据保护惯例的信息，请查阅睿医的隐私政策。该政策解释了睿医如何处理您的个人信息，并在您使用服务时保护您的隐私。\n        7.2  您同意按照睿医的隐私政策使用您的数据。\n<b>8.  服务内容</b>\n        8.1  您理解，作为服务的一部分或通过您使用服务得到的所有信息（如数据文件、书面文本、电脑软件、音乐、音像文件或其他声音、图片、录像或其他图像），完全由该内容出处的人员负责。所有该等信息下称\"内容\"。\n        8.2  您应意识到作为服务一部分展示给您的内容，包括但不限于服务中的广告及服务中的赞助内容，可能受向睿医提供内容的赞助者或广告商（或代表其的其他人员或公司）所拥有的知识产权的保护。 您不得修改、租赁、出租、借贷、出售、分发该内容（无论全部还是部分）或根据该内容创作衍生作品，除非睿医或内容所有人在单独协议中特别告知您可以为之。\n        8.3  睿医保留从任何服务中筛选、审阅、标明、过滤、修订、拒绝或删除任何或所有内容的权利（但无义务这样做）。就某些服务而言，睿医可提供滤除明确色情内容、政治相关内容的工具。此外，还有可以通过商业渠道获得的服务和软件能够限制访问令您反感的材料。\n        8.4  您理解：通过使用服务，您可能会接触到您觉得冒犯的、粗鄙的、反感的内容，您使用服务时与此相关的风险由您自行承担。\n        8.5  您同意独自就您在使用服务时创作、传送或展示的任何内容以及您做出该等行为的后果（包括睿医可能遭受的任何损失或损害）承担责任（睿医不对您或任何第三方承担责任）。\n<b>9.  专有权利</b>\n        9.1  您认知并同意，睿医（或睿医的许可方）对服务拥有一切法定权利、所有权和利益，包括存在于服务中的任何知识产权（无论该等权利是否已经登记，也不论该等权利在世界的何等地方存在）。 您进一步认知，服务可能包括睿医指定为保密的信息，未经睿医事先书面同意，您不得披露该等信息。\n        9.2  除非您与睿医另有书面协议，否则本条款中的任何规定均未给予您使用睿医任何商号、商标、服务标记、标识、域名及其他显著品牌特征的权利。\n        9.3  如果您在与睿医的单独书面协议中被给予一项使用上述品牌特征的明确的权利，则您同意您在使用该等品牌特征时遵守该协议、本条款的任何适用规定以及不时更新的睿医品牌特征使用指南。\n        9.4  除第11条规定的限制许可外，睿医认知并同意，其不在本条款项下获得您（或您的许可方）对在服务上或通过服务提交、张贴、传输或展示的任何内容的任何权利、所有权或利益， 包括该内容中存在的任何知识产权（无论该等权利是否已经登记，亦不论该等权利在世界的何等地方存在）。除非您与睿医另有书面协议，否则您同意您负责保护并强制执行这些权利，睿医没有义务代表您这样做。\n        9.5  您同意您不得删除、掩藏或改动服务所附的或包含的任何专有权利声明（包括著作权和商标声明）。\n        9.6  除非您得到睿医书面明确授权这样做，否则您同意在使用服务时，您将不以可能或故意导致混淆该等商标、名称或标识的所有者或授权用户的方式使用任何公司或组织的商标、服务标识、商号、标识。\n<b>10.  睿医的许可</b>\n        10.1  睿医给予您一项个人的、全世界范围内的、不可转让及非排他性的许可，以使用作为睿医向您所供服务的一部分而向您提供的软件（下称\"软件\"）。此项许可仅以使您可以根据本条款允许的方式使用和享用睿医提供的服务的益处为目的。\n        10.2  您不得（且您不得允许任何其他人）拷贝、修改软件或软件的任何部分，或对软件或软件的任何部分创作衍生作品，进行反向工程、反编辑或试图从软件或软件的任何部分提取源代码，但法律明确允许或要求的或睿医特别书面告知您的除外。\n        10.3  除非睿医给予您明确的书面允许，否则您不得转让您对软件的使用权（或授予该使用权的分许可）、在您对软件的使用权上设置担保权益或以其他方式转让您对软件的使用权的任何部分。\n<b>11.您对内容的许可</b>\n        11.1  您保留你在服务上或通过服务提交、张贴或展示的内容中已持有的著作权及任何其他权利。通过提交、张贴或展示内容， 您给予睿医一项永久性的、不可撤销的、世界范围内的、免交使用费的及非排他性的许可，以复制、改编、修改、翻译、发布、公开实施、公开展示及分发您在服务上或通过服务提交、张贴或展示的任何内容。 此项许可仅以使睿医可以展示、分发及宣传服务为目的，并可按某些服务的附加条款就该等服务撤销此项许可。\n        11.2  您同意此项许可包括一项权利，使睿医可将该等内容提供给与睿医有提供联合服务的关系的其他公司、组织或个人，并就联合服务的提供使用该内容。\n        11.3  您理解，睿医在实施所需的技术措施向用户提供服务时，可(a)在不同的公共网络和不同的媒体传送或分发您的内容；(b)对您的内容作出必要的变更以使内容符合、适应连接网络、装置、服务或介质的技术要求。您同意此项许可允许睿医采取这些行动。\n        11.4  您向睿医确认并保证您拥有所有必要的权利、权力和授权授予上述许可。\n<b>12.  您使用的软件可从睿医不时地自动下载和安装更新版本。这些更新旨在改进、增强和进一步开发服务并可采用修正版、强化功能、新软件模块和全新版本的形式。您同意接受该等更新（并允许睿医向您交付）作为您使用服务的一部分。</b>\n<b>13.  终止您与睿医的关系</b>\n        13.1  本条款将持续适用直至根据下述规定由您或睿医终止。\n        13.2  如果您希望终止与睿医的法律协议，您可通过下列方式完成：(a)在任何时候通知睿医及(b)在睿医向您提供选择的情况下，关闭您使用的所有服务的帐户。您的通知应书面发送至本条款起始之处规定的睿医地址。\n        13.3  发生下列情况时睿医可终止其与您的法律协议：\n                (A)  您违反了本条款的任何规定（或您的行为方式明确显示您不打算或不能遵守本条款规定）；或\n                (B)  法律要求睿医这样做（例如：向您提供服务不合法或变得不合法）；或\n                (C)  睿医与之一起向您提供服务的合作伙伴已终止与睿医的关系或停止向您提供服务；或\n                (D)  睿医转变为不再向您居住的或您从那里使用服务的国家内的用户提供服务；或\n                (E)  睿医认为，睿医向您提供服务不再具有商业可行性。\n        13.4  本条的任何规定不得影响睿医与根据第4条提供服务有关的权利。\n        13.5  本条款终止时，您和睿医已经享受或承担的（或在本条款有效期间已经产生的）或明确规定为无限期有效的所有法定权利、义务和责任不受该终止的影响，第20.7条的规定应无限期地适用于该等权利、义务和责任。\n<b>14.  不包括其他保证</b>\n        14.1  本条款中的任何规定，包括第14和第15条，均不排除或限制睿医根据适用法律不能合法排除或限制的损失保证或责任。某些司法辖区不允许排除某些保证或条件，或限制或排除对由于疏忽、违约、违反暗含条款引起的损失或损害或对附带或后果性损害的责任。 因此，只有在您的司法辖区合法的限制对您适用，并且我们的责任将在法律允许的最大限度内受到限制。\n        14.2  您明示理解并同意，您对使用服务独自承担风险并且服务按\"现状\"和\"原样\"的方式提供。\n        14.3  尤其是，睿医、其子公司和关联公司及其许可人，不就以下各项向您作出陈述或保证：\n                (A)  您对服务的使用将符合您的需求；\n                (B)  您对服务的使用将无中断、及时、安全或没有错误；\n                (C)  由于您使用服务而获得的任何信息将是准确的或可靠的；及\n                (D)  作为服务的一部分向您提供的任何软件的运行或功能中的缺陷将被纠正。\n        14.4  通过使用服务而下载或以其他方式获得的任何材料由您自行作出并承担风险，您将独自对由于下载任何该等材料而导致对电脑系统或其他装置的损害或数据的丢失负责。\n        14.5  您从睿医获得的或通过服务或从服务获得的任何建议或信息（无论口头还是书面的）均不创立本条款中未明确规定的任何保证。\n        14.6  睿医进一步明确否认任何种类的所有保证和条件（无论明示还是默示的），包括但不限于适销性、适合特定目的及不侵权的默示保证和条件。\n<b>15.  责任限制</b>\n        15.1  在遵守上文第14.1条全部规定的前提下，您明示理解并同意，睿医、其子公司和关联公司及其许可人不就以下事项对您承担责任：\n                (A)  您无论由于何种原因和在任何责任理论项下发生的任何直接、间接、附带、特殊、后果性或惩罚性的损害。这应包括但不限于任何利润损失（无论是直接还是间接发生）、任何商誉或业务声誉损失、任何数据丢失、替代物品或服务的购买费用或其他无形损失；\n                (B)  您可能产生的任何损失或损害，包括但不限于由下列原因导致的损失或损害：\n                (I)  您对任何广告的完整性、准确性或其存在的信任， 或作为您与其广告出现在服务中的任何广告商或赞助人之间的任何关系或交易的结果；\n                (II)  睿医对服务可能做出的变更，或永久或暂时停止提供服务（或服务中的任何功能）；\n                (III)  对通过您使用服务而维持或传输的任何内容及其他通信数据的删除、毁坏或未能将其储存；\n                (IV)  您未向睿医提供准确的帐户信息；\n                (V)  您未对您的密码或帐户资料保持安全及保密；\n        15.2  无论睿医是否接到通知或是否应已知晓引起任何该等损失的可能性，上文第15.1条中睿医对您的责任限制均应适用。\n<b>16.  对关于符合适用国际知识产权法（包括中国的《著作权法》）的指称的著作权侵权通知做出回应以及终止重复侵权者帐户是睿医的政策。</b>\n<b>17.  广告</b>\n        17.1  部分服务由广告收入支持，可展示广告和推销。这些广告可能是针对存储于服务中的信息、通过服务提出的询问或其他信息的内容提供的。\n        17.2  睿医在服务上的广告的方式、模式和范围可不经向您特别通知而变更。\n        17.3  作为睿医授予您访问和使用服务的权利的对价，您同意睿医可以在服务上加载该等广告。\n<b>18.  其他内容</b>\n        18.1  服务可包含对其他网站或内容或资源的超级链接。睿医可能并不控制由睿医以外的公司或个人提供的任何网站或资源。\n        18.2  您认知并同意，睿医不对该等外部网站或资源的可用性负责，亦不对该等网络或资源上的或从该等网站或资源获得的任何广告、产品或其他材料加以认可。\n        18.3  您认知并同意，睿医不对由于您由于那些外部的网站或资源的可用性或您对该等网站或资源上的或从该等网站或资源获得的任何广告、产品或其他材料的完整性、准确性或存在的信赖而发生的任何损失或损害承担责任。\n<b>19.  本条款的变更</b>\n        19.1  睿医可不时对通用条款或附加条款作出变更。\n        19.2  您理解并同意，如果您在通用条款或附加条款变更日期之后使用服务，则睿医将把您的使用视为接受更新后的通用条款或附加条款。\n<b>20.  一般法律条款</b>\n        20.1  有时候您使用服务，您即可（作为您使用服务的结果或通过您对服务的使用）使用其他人或公司提供的某项服务或下载一个其他人或公司提供的软件，或购买其他人或公司提供的商品。 您对这些其他服务、软件或商品的使用受限于您和相关公司或个人的单独条款。在此情况下，本条款不影响您和这些其他公司或个人的法律关系。\n        20.2  本条款构成您和睿医之间关于您使用服务（但不包括根据单独书面协议睿医向您提供的任何服务）的全部法律协议，并完全取代您和睿医先前就服务达成的任何协议。\n        20.3  睿医有义务对您提交的个人信息保密，未经允许不得透露给第三方。您同意睿医可通过电子邮件发送各种通知及各种非商业或商业性质的内容。\n        20.4  您同意，如果睿医未行使或未强制执行包含在本条款中的（或睿医在任何适用法律下有权享受的）任何法定权利或救济，不可视为对睿医权利的正式放弃，这些权利或救济仍对睿医有效。\n        20.5  如果对该等事项有司法决定权的任何法院，判定本条款的任何规定无效，则该等规定将从本条款中删除，而不影响本条款的其他部分。本条款的其余部分将继续有效并可强制执行。\n        20.6  您认知并同意，睿医为母公司的公司集团的每一成员应为本条款的第三方受益人，该等其他公司应有权直接强制执行和依赖赋予其利益（或权利）的本条款的任何规定。此外，没有任何人或公司应是本条款的第三方受益人。\n        20.7  本条款及本条款项下您与睿医的关系，受中国法律管辖，但排除其冲突法规定。您与睿医均同意接受位于中国境内的法院的专属管辖权，以解决任何由本条款引起的法律事项。 尽管有上述规定，您同意睿医仍被允许请求任何辖区内的禁制令救济（或同等类型的紧急法定救济）。"

@implementation serviceProtocolViewController

@synthesize delegate;
@synthesize scrollView;

- (id)initWithNibName:(NSString *)nibNameOrNil bundle:(NSBundle *)nibBundleOrNil
{
    self = [super initWithNibName:nibNameOrNil bundle:nibBundleOrNil];
    if (self) {
        // Custom initialization
    }
    return self;
}

- (void)viewDidLoad
{
    [super viewDidLoad];
    [self behavior:@"viewDidLoad"];
    // Do any additional setup after loading the view from its nib.
    NSString* serviceProtocol = TXT_SERVICE_PROTOCOL;
    NMCustomLabel* splebel = [[NMCustomLabel alloc] init];
    splebel.text = serviceProtocol;
    splebel.font = [UIFont fontWithName:@"Palatino" size:16];
	splebel.fontBold = [UIFont fontWithName:@"Palatino-Bold" size:16];
	splebel.fontItalic = [UIFont fontWithName:@"Palatino-Italic" size:16];
    splebel.backgroundColor = [UIColor clearColor];
    splebel.textColor = RGBCOLOR(100, 100, 100);
    splebel.textColorBold = RGBCOLOR(100, 100, 100);
    splebel.lineHeight = 20;
    splebel.frame = CGRectMake(10, 0, scrollView.frame.size.width - 20, 40000);
    [splebel sizeToFit];
    [scrollView addSubview:splebel];
    scrollView.contentSize = splebel.frame.size;
}

- (void)viewDidUnload
{
    [super viewDidUnload];
    // Release any retained subviews of the main view.
    // e.g. self.myOutlet = nil;
}

- (BOOL)shouldAutorotateToInterfaceOrientation:(UIInterfaceOrientation)interfaceOrientation
{
	return YES;
}

- (IBAction)backButtonTapped:(id)sender
{
    [self behavior:@"backButtonTapped"];
    NSLog(@"backRegisterViewButtonTapped");
    [self.navigationController popViewControllerAnimated:YES];
}

- (void)behavior:(NSString *)status
{
    NSString* json = [NSString stringWithFormat:@"{\"status\":\"%@\"", status];
    [ImdAppBehavior registerLog:[Util getUsername] MACAddr:[Util getMacAddress] pageName:REGISTER_SERVER_PROP paramJson:json];
}

@end
